Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--liblas_overview.tmx
Source language: en
Languages: ja

source: LiDAR Data Access
ja: LiDAR データアクセス

source: libLAS is a C/C++ library for reading and writing the very common `LAS` `LiDAR`_ format. The `ASPRS LAS format`_ is a sequential binary format used to store data from LiDAR sensors and by LiDAR processing software for data interchange and archival.
ja: ibLAS は一般的な `LAS` `LiDAR`_ フォーマットを読み書きするための C/C++ ライブラリです。 `ASPRS LAS format`_ は LiDAR センサや LiDAR 処理ソフトウェアがデータの保存、交換，アーカイブに使用しているシーケンシャルなバイナリフォーマットです。

source: LiDAR (Light Detection and Ranging) is a form of high precision range detection much like a radar system that uses laser light as the electromagnetic emission. One of LiDAR systems' products is a "point cloud" data product that can be conceptualized as a series of point measurements representing distance from the sensor to a returned emission. A common storage format for these point cloud data is ASPRS LAS format.
ja: LiDAR (ライダー、Light Detection and Ranging) はレーダーと似た高精度な距離検出の一種で、電磁放射線の代わりにレーザー光線を使用するものです。LiDAR システムは "点群" データのように、センサからの距離等を反射波を用いて計測した結果を概念化したデータを出力します。一般的な点群データの保存に使用されているのが ASPRS LAS フォーマットです。

source: Core Features
ja: 主な機能

source: C/C++/Python APIs for reading, writing, and manipulating LAS data
ja: LAS データの読み込み、書き込み、操作に使用する C/C++/Python API

source: `Command line utilities`_ for manipulating LAS data based on `LAStools`_
ja: `LAStools`_ に基づく LAS データを操作するための `コマンドラインユーティリティ`_

source: Coordinate reprojection via `GDAL <https://gdal.org>`__
ja: `GDAL <https://gdal.org>`_ 経由での投影法の変換

source: Details
ja: 詳細

source: **Website:** https://liblas.org/
ja: **Webサイト:** https://liblas.org/

source: **Licence:** BSD
ja: **ライセンス:** BSD

source: **Software Version:** |version-liblas|
ja: **ソフトウェアバージョン:** |version-liblas|

source: **Supported Platforms:** Cross Platform C++ -- Mac OS X, Windows (via `OSGeo4W`_), and Linux
ja: **対応プラットフォーム:** クロスプラットフォーム C++ -- Mac OS X, Windows (`OSGeo4W`_ 経由), Linux

source: **API Interfaces:** C, C++, Python
ja: **API インターフェイス:** C, C++, Python

source: **Support:** `Communication and Support <https://liblas.org/community.html>`_
ja: **サポート：** `コミュニケーションとサポート <https://liblas.org/community.html>`_

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/liblas_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/liblas_quickstart>`
